Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: := += -= *= /= ++ -- have consistent behaviour regardless of whether they are used on their own or combined with other operators, such as with x := y, y += 2.
ja: := += -= *= /= ++ -- x := y, y += 2のように、単独で使うか、他の演算子と組み合わせて使うかにかかわらず、一貫した動作をします。

source: := must be used in place of = when initializing a declared variable or optional parameter.
ja: 宣言された変数やオプションのパラメータを初期化する場合は、=の代わりに:= を使用する必要があります。

source: :=, +=, -=, *=, /=, ++ and -- have consistent behaviour regardless of whether they are used on their own or combined with other operators, such as with x := y, y += 2.
ja: :=、+=、-=、*=、/=、++、--は、単独で使用されても、x := y, y += 2など他の演算子と組み合わされても、一貫した動作をする。

source: <, <=, >, >= or =.
ja: <、<=、>、>=または=。

source: <> has been removed.
ja: <>は、廃止されました。

source: SendEvent "{Click 6 52 Down}{Click 45 52 Up}".
ja: SendEvent "{Click 6 52 Down}{Click 45 52 Up}"を送信します。

source: Classname() (formerly new Classname()) now fails to create the object if the __New method is defined and it could not be called (e.g. because the parameter count is incorrect), or if parameters were passed and __New is not defined.
ja: Classname()（以前のnew Classname()）は、__Newメソッドが定義されているのに呼び出せなかった場合（例：パラメータ数が不正確なため）、またはパラメータが渡されたのに__Newが定義されていない場合、オブジェクトの作成に失敗するようになりました。

source: Value is Class yields true (1) if Value is an instance of Class or false (0) otherwise.
ja: Value is Class は、ValueがClassのインスタンスであれば真(1)を、そうでなければ偽(0)を返す。

source: object[params] is equivalent to object.__Item[params] when there are parameters.
ja: パラメータがある場合、object[params]はobject.__Item[params]と等価である。

source: object[] is equivalent to object.__Item.
ja: object[]はobject.__Itemと等価である。

source: in and contains are reserved for future use.
ja: inとcontainsは将来の使用のために予約されている。

source: >>> and >>>= have been added for logical right bit shift.
ja: 論理右ビットシフトに>>>と>>>=が追加されました。

source: AStr (without any suffix) is now input-only.
ja: AStr（接尾辞なし）は入力専用になりました。

source: AbortRetryIgnore, A/R/I or ARI
ja: AbortRetryIgnore、A/R/IまたはARI

source: Alpha.%vBeta%, Alpha.%vBeta%[Param] and Alpha.%vBeta%() are also member access, but vBeta is a variable or sub-expression.
ja: Alpha.%vBeta%、Alpha.%vBeta%[Param]、およびAlpha.%vBeta%()もメンバーアクセスですが、vBetaは変数または副式です。

source: Alpha.Beta() is a method call, as described above.
ja: Alpha.Beta()は、上記の通り、メソッド呼び出しです。

source: Alpha.Beta is often called member access.
ja: Alpha.Betaは メンバーアクセスと呼ばれることが多い。

source: Alpha.Beta[Param] is a specialised form of member access which includes additional parameters in the request.
ja: Alpha.Beta[Param]は、リクエストに追加のパラメータを含む特別な会員アクセスの形態です。

source: Alpha[Index] accesses the default property of Alpha, giving Index as a parameter.
ja: Alpha[Index]は、Indexをパラメータとして、Alphaのデフォルトのプロパティにアクセスします。

source: Any.Prototype defines methods and properties that are applicable to all values and objects (currently excluding ComValue and derived types) unless overridden.
ja: Any.Prototypeは、オーバーライドされない限り、すべての値およびオブジェクト（現在はComValueおよび派生型を除く）に適用されるメソッドおよびプロパティを定義します。

source: Any is the class at the root of AutoHotkey's type hierarchy.
ja: Anyは、AutoHotkeyのタイプ階層のルートにあるクラスです。

source: Buffer(Size, FillByte) (calling the Buffer class) creates and returns a Buffer object encapsulating a block of Size bytes of memory, initialized only if FillByte is specified.
ja: Buffer(Size, FillByte)（Bufferクラスを呼び出します）は、Sizeバイトのメモリブロックを内包するBufferオブジェクトを生成し、FillByteが指定された場合のみ初期化して返しつす。

source: C:\ and C:\My Documents.
ja: C:\ および C:\My Documents.

source: C:\Windows\System32\cmd.exe -- then press OK.
ja: C:\Windows\System32\cmd.exe -- を入力したのち、OKを推してください。.

source: CPnnn: a code page with numeric identifier nnn.
ja: CPnnn：数値識別子nnnを持つコードページです。

source: CancelTryAgainContinue, C/T/C or CTC
ja: CancelTryAgainContinue、C/T/CまたはCTC

source: CaretGetPos([&OutputVarX, &OutputVarY]) retrieves the current coordinates of the caret (text insertion point).
ja: CaretGetPos([&OutputVarX, &OutputVarY])は、キャレット（テキスト挿入点）の現在の座標を取得します。

source: CaretGetPos([&X, &Y]) retrieves the current coordinates of the caret (text insertion point).
ja: CaretGetPos([&X,&Y])は、キャレット（テキスト挿入点）の現在の座標を取得します。

source: Choose no longer serves as a redundant (undocumented) way to specify the value for a MonthCal.
ja: Chooseは、もはやMonthCalの値を指定する冗長な（文書化されていない）方法として機能しません。

source: Chr(0) returns a string of length 1, containing a binary zero.
ja: Chr(0)は、2進数の0を含む、長さ1の文字列を返します。

source: ClipboardAll([Data, Size]) creates an object containing everything on the clipboard (optionally accepting data previously retrieved from the clipboard instead of using the clipboard's current contents).
ja: ClipboardAll([Data, Size])は、クリップボード上のすべてのデータを含むオブジェクトを作成します（オプションとして、クリップボードの現在の内容を使用する代わりに、以前にクリップボードから取得したデータを受け入れることができます）。

source: ClipboardAll itself is a class derived from Buffer.
ja: ClipboardAll自体は、Bufferから派生したクラスです。

source: ComCall(offset, comobj, ...) is equivalent to DllCall(NumGet(NumGet(comobj.ptr) + offset * A_Index), "ptr", comobj.ptr, ...), but with the return type defaulting to "hresult" rather than "int".
ja: ComCall(offset, comobj, ...)はDllCall(NumGet(comobj.ptr) + offset * A_Index), "ptr", comobj.ptr, ...)と同等ですが、戻り値の型のデフォルトが "int" でなく "hresult" となっています。

source: ComCall(offset, comobj, ...) is equivalent to DllCall(NumGet(NumGet(comobj.ptr) + offset * A_Index), "ptr", comobj.ptr, ...), but with the return type defaulting to HRESULT rather than Int.
ja: ComCall(offset, comobj, ...)はDllCall(NumGet(comobj.ptr) + offset * A_Index), "ptr", comobj.ptr, ...)と同等ですが、戻り値の型のデフォルトがIntでなくHRESULTとなっています。

source: ComObj(): This function had a sort of wildcard name, allowing many different suffixes.
ja: ComObj()：この機能は、ワイルドカードのような名前で、さまざまな接尾辞をつけることができました。

source: ComObjArray is for VT_ARRAY (SafeArrays).
ja: ComObjArrayは、VT_ARRAY(SafeArrays)用です。

source: ComObjArray itself is a class derived from ComValue, but is used only to create or identify SafeArray wrapper objects.
ja: ComObjArray自体はComValueから派生したクラスですが、SafeArrayのラッパーオブジェクトを作成または識別するためにのみ使用されます。

source: ComObjFromPtr(pdsp) is a function similar to ComObjEnwrap(dsp), but like ObjFromPtr, it does not call AddRef on the pointer.
ja: ComObjFromPtr(pdsp)はComObjEnwrap(dsp)と同様の関数ですが、ObjFromPtrのようにポインタに対してAddRefを呼び出すことはしません。

source: ComObject(CLSID) creates a ComObject; i.e. this is the new ComObjCreate.
ja: ComObject(CLSID)は、ComObjectを作成します。つまり、これは新しいComObjCreateです。

source: ComObject is for VT_DISPATCH with a non-null pointer; that is, typically a valid COM object that can be invoked by the script using normal object syntax.
ja: ComObjectは、VT_DISPATCHの非NULLポインタのためのもので、つまり、通常、通常のオブジェクト構文を使用してスクリプトから呼び出すことができる有効なCOMオブジェクトです。

source: ComObject itself is a class derived from ComValue, but is used only to create or identify COM objects.
ja: ComObject自体はComValueから派生したクラスですが、COMオブジェクトの作成または識別にのみ使用されます。

source: ComValue(vt, value) creates a wrapper object.
ja: ComValue(vt, value)は、ラッパーオブジェクトを作成します。

source: ComValue is the base class for all COM wrapper objects.
ja: ComValueは、すべてのCOMラッパーオブジェクトの基本クラスです。

source: ComValue itself is a class derived from Any, but is used only to create or identify COM wrapper objects.
ja: ComValue自体はAnyから派生したクラスですが、COMラッパーオブジェクトを作成または識別するためにのみ使用されます。

source: ComValueRef is for VT_BYREF.
ja: ComValueRefは、VT_BYREF用です。

source: Critical "Off" cancels the current thread's period of uninterruptibility even if the thread was not Critical, thereby letting events such as Size be processed sooner or more predictably.
ja: Critical "Off"は、クリティカルでないスレッドでも、現在のスレッドの無停止期間をキャンセルし、サイズなどのイベントをより早く、より予測的に処理することができるようにします。

source: Critical -1 turns on Critical but disables message checks.
ja: Critical -1は、クリティカルをオンにするが、メッセージチェックを無効にします。

source: Default followed immediately by an integer sets the nth button as default.
ja: Defaultの後に整数が続くと、n番目のボタンがデフォルトになります。

source: Default is not required to be listed last.
ja: デフォルトは最後に表示される必要はない。

source: DirExist(FilePattern), with usage similar to FileExist.
ja: DirExist(FilePattern)、使い方はFileExistと同様です。

source: DirExist(Path), with usage similar to FileExist.
ja: DirExist(Path)、使い方はFileExistと同様です。

source: False if the user pressed Menu or Shift+F10.
ja: ユーザーがMenuまたはShift+F10を押した場合、Falseになります。

source: File.Tell() was removed.
ja: File.Tell()が削除されました。

source: Float(Value), Integer(Value) and String(Value) convert Value to the respective type, or throw an exception if the conversion cannot be performed (e.g. Integer("1z")).
ja: Float(Value),Integer(Value),String(Value) は、Valueをそれぞれの型に変換し、変換できない場合は例外を投げます（例：Integer("1z")）。

source: Float(Value): See Types further above.
ja: Float(Value)：上記のさらに上の「タイプ」を参照してください。

source: Float(v), Integer(v) and String(v) convert v to the respective type, or throw an exception if the conversion cannot be performed (e.g. Integer("1z")).
ja: Float(v),Integer(v),String(v) は、vをそれぞれの型に変換し、変換できない場合は例外を投げます（例：Integer("1z")）。

source: Format("0x{:x}", n) produces lowercase a-f while Format("0x{:X}", n) produces uppercase A-F.
ja: Format("0x{:x}", n)では小文字のa-fが、Format("0x{:X}", n)では大文字のA-Fが生成されます。

source: GetMethod(Value, "Call", N) is not the same as GetMethod(Value,, N), as the Call method takes the function object itself as a parameter, and its usage may otherwise differ from that of Value.
ja: GetMethod(Value, "Call", N)は、GetMethod(Value,, N)とは異なり、Callメソッドは関数オブジェクト自身をパラメータとし、その使用方法はValueと異なる場合があります。

source: Gui.Control serves as the base class for all GUI controls, but each type of control has its own class.
ja: Gui.ControlはすべてのGUIコントロールの基本クラスとして機能しますが、コントロールの種類によって独自のクラスが存在します。

source: HasMethod(Value) works with all AutoHotkey values and objects and cannot be overridden, but will return false if the presence of a Call method cannot be determined.
ja: HasMethod(Value)は、すべてのAutoHotkeyの値およびオブジェクトで動作し、オーバーライドすることはできませんが、Callメソッドの存在を判断できない場合はfalseを返します。

source: HotIf or HotIfWinActive.
ja: HotIf または HotIfWinActive.

source: Iconx, Icon?, Icon! and Iconi set the icon.
ja: Iconx、Icon?、Icon!、Iconiは、アイコンを設定します。

source: If var is type identified certain (possibly locale-specific) non-ASCII characters as alphabetic/uppercase/lowercase by default in v1.0, whereas it did so in v1.1 only if StringCaseSense, Locale was used.
ja: If var is type は v1.0 では特定の（おそらくロケール固有の）非 ASCII 文字をデフォルトでアルファベット/アッパーケース/小文字として識別しましたが、 v1.1 では StringCaseSense, Locale が使われている場合にのみそうしていました。

source: If, Else, Loop, While, For, Try, Catch and Finally.
ja: If、Else、Loop、While、For、Try、Catch、および、Finally

source: Input was removed.
ja: Inputは、削除されました。

source: InstallKeybdHook(Install := true, Force := false) and InstallMouseHook(Install := true, Force := false) replace the corresponding directives, for increased flexibility.
ja: InstallKeybdHook(Install := true, Force := false)とInstallMouseHook(Install := true, Force := false)は、柔軟性を高めるために、対応するディレクティブを置き換えるものです。

source: InstallKeybdHook([Install, Force]) and InstallMouseHook([Install, Force]) replace the corresponding directives, for increased flexibility.
ja: InstallKeybdHook(Install, Force)とInstallMouseHook(Install, Force)は、柔軟性を高めるために、対応するディレクティブを置き換えるものです。

source: Integer(Value): See Types further above.
ja: Integer(Value)：上記のさらに上の「タイプ」を参照してください。

source: IsSet(Var), IsSetRef(&Ref): Returns 1 (true) if the variable has been assigned a value (even if that value is an empty string), otherwise 0 (false).
ja: IsSet(Var)、IsSetRef(&Ref)：変数に値が割り当てられている場合（その値が空文字列であっても）1 (true)を、そうでない場合0 (false)を返します。

source: KeyHistory N resizes the key history buffer instead of displaying the key history.
ja: KeyHistory Nは、キーヒストリーを表示するのではなく、キーヒストリーバッファーのサイズを変更します。

source: LWin:: would create a hotkey activated by pressing down the left Windows key without any other modifier keys.
ja: LWin::は、他の修飾キーを使わずに、左のWindowsキーを押し下げることで起動するホットキーを作成します。

source: ListLines False and ListLines True can be used to selectively omit some lines from the history, which can help prevent the history from filling up too quickly (such as in a loop with many fast iterations).
ja: ListLines FalseとListLines Trueを使用すると、履歴から一部の行を選択的に省略することができ、履歴が早くいっぱいになるのを防ぐことができます（高速反復の多いループの場合など）。

source: ListLines Mode can be used to selectively omit some lines from the history, which can help prevent the history from filling up too quickly (such as in a loop with many fast iterations).
ja: ListLinesモードを使用すると、履歴から一部の行を選択的に省略することができ、履歴が早くいっぱいになるのを防ぐことができます（高速反復の多いループの場合など）。

source: ListLines (with no parameter) is equivalent to selecting the "View->Lines most recently executed" menu item in the main window.
ja: ListLines（パラメータなし）は、メインウィンドウの「View->Lines most recently executed」メニュー項目を選択することと同等です。

source: Menu()/MenuBar() returns a new Menu/MenuBar object, which has the following members corresponding to v1 Menu sub-commands.
ja: Menu()/MenuBar()は、v1 Menu サブコマンドに対応する以下のメンバを持つ新しい Menu/MenuBar オブジェクトを返します。

source: MenuFromHandle(Handle) returns the Menu object corresponding to a Win32 menu handle, if it was created by AutoHotkey.
ja: MenuFromHandle(Handle)は、Win32メニューハンドルがAutoHotkeyによって作成された場合、それに対応するMenuオブジェクトを返します。

source: MyArray[Index] actually invokes the __Item property of MyArray, passing Index as a parameter.
ja: MyArray[Index]は、実際にはMyArrayの__Itemプロパティを呼び出し、Indexをパラメータとして渡す。

source: MyFunc(Params*) is a variadic function call.
ja: MyFunc(Params*)は、可変長引数関数呼び出しです。

source: NA avoids marking the target window as active and avoids merging its input processing with that of the script, which may prevent physical movement of the mouse from interfering (but usually only when the target window is not active).
ja: NAは、ターゲットウィンドウをアクティブとしてマークすることを避け、その入力処理をスクリプトのそれと統合することを避けるため、マウスの物理的な動きが干渉しない場合があります（ただし、通常はターゲットウィンドウがアクティブでない場合のみ）。

source: Nested.Class := 1 is an error by default (the property is read-only).
ja: Nested.Class := 1はデフォルトでエラーとなります（プロパティは読み取り専用です）。

source: Nested.Class() does not pass Nested to Nested.Class.Call and ultimately __New, which would otherwise happen because this is the normal behaviour for function objects called as methods (which is how the nested class is being used here).
ja: Nested.Class()では、Nestedを Nested.Class.Call、ひいては__Newに渡しません。これは、メソッドとして呼び出される関数オブジェクトの通常の動作です（ここでは、入れ子のクラスはこのように使用されています）。

source: NewError.Line and NewError.File indicate the line which called the function.
ja: NewError.Lineと NewError.Fileは、関数を呼び出した行を示します。

source: NewError.Stack contains a partial stack trace, with the indicated stack frame at the top.
ja: NewError.Stackには、指示されたスタックフレームを先頭とする部分的なスタックトレースが含まれます。

source: NewError.What contains the name of the function.
ja: NewError.Whatには、関数の名前が含まれています。

source: Number(Value): See Types further above.
ja: Number(Value)：上記のさらに上の「タイプ」を参照してください。

source: OK or O
ja: OKまたはO

source: OK, OKCancel, AbortRetryIgnore, YesNoCancel, YesNo, RetryCancel, CancelTryAgainContinue, or just the initials separated by slashes (o/c, y/n, etc.), or just the initials without slashes.
ja: OK、OKCancel、AbortRetryIgnore、YesNoCancel、YesNo、RetryCancel、CancelTryAgainContinue、またはスラッシュで区切ったイニシャルのみ（o/c、y/nなど）、またはスラッシュなしのイニシャルのみです。

source: OKCancel, O/C or OC
ja: OKCancel、O/CまたはOC

source: Owner followed immediately by a HWND sets the owner, overriding the Gui +OwnDialogs option.
ja: Ownerの後にHWNDが続くと所有者が設定され、Gui +OwnDialogsオプションをオーバーライドします。

source: Persistent() or Persistent(true) was called and not reversed by calling Persistent(false).
ja: Persistent()またはPersistent(true)が呼び出され、Persistent(false)を呼び出しても元に戻らなかった場合。

source: Persistent(Persist := true) replaces the corresponding directive, increasing flexibility.
ja: Persistent(Persist := true)は、対応するディレクティブを置き換えることで、柔軟性を高めています。

source: Persistent([Persist]) replaces the corresponding directive, increasing flexibility.
ja: Persistent(Persist)は、対応するディレクティブを置き換えることで、柔軟性を高めています。

source: RegDeleteKey("RootKey\SubKey") deletes a registry key.
ja: RegDeleteKey("RootKeySubKey")は、レジストリキーを削除します。

source: RegDeleteKey([KeyName]) deletes a registry key.
ja: RegDeleteKey([KeyName])は、レジストリキーを削除します。

source: Result (String):
ja: Result（文字列）：

source: Result (String): One of the following words indicating how the input box was closed: OK, Cancel, or Timeout.
ja: Result（文字列）：入力ボックスがどのように閉じられたかを示す次のいずれかの単語：OK、Cancel、またはTimeout。

source: RetryCancel, R/C or RC
ja: RetryCancel、R/CまたはRC

source: Send "!+a" presses Alt+Shift+A
ja: Send "!+a" は、Alt+Shift+Aを押します

source: Send "!a" presses Alt+A
ja: Send "!a" は、Alt+Aを押します

source: Send "#e" holds down Win and presses E
ja: Send "#e" は、Winを押しながらEを押します

source: Send "#e" holds down Win and then presses E
ja: Send "#e" は、Winを押しながらEを押します。

source: Send "+abC" sends the text "AbC"
ja: Send "+abC"は、テキスト「AbC」を送信します

source: Send "My First Script" is how you send keystrokes.
ja: Send "My First Script" は、送信キー入力の方法です。

source: Send "^{Home}" presses Ctrl+Home
ja: Send "^{Home}"Ctrl+Homeを押す

source: StrCompare(String1, String2 [, CaseSense]) returns -1 (String1 is less than String2), 0 (equal) or 1 (greater than).
ja: StrCompare(String1, String2 [, CaseSense]) は、-1（String1 は String2 よりも小さい）、0（等しい）、1（より大きい）を返します。

source: StrCompare(str1, str2 [, CaseSense := false]) returns -1 (str1 is less than str2), 0 (equal) or 1 (greater than).
ja: StrCompare(str1, str2 [, CaseSense := false]) は、-1 (str1 は str2 よりも小さい)、0 (等しい)、1 (より大きい) を返します。

source: StrPtr(Value) returns the address of a string.
ja: StrPtr(Value)は、文字列のアドレスを返します。

source: StrPtr(str) returns the address of a string.
ja: StrPtr(str)は、文字列のアドレスを返します。

source: String(Value): See Types further above.
ja: String(Value)：上記のさらに上の「タイプ」を参照してください。

source: SysGetIPAddresses() returns an array of IP addresses, equivalent to the A_IPAddress variables which have been removed.
ja: SysGetIPAddresses()は、削除されたA_IPAddress変数に相当するIPアドレスの配列を返すものです。

source: T followed immediately by an integer or floating-point number sets the timeout, in seconds.
ja: Tの後に整数または浮動小数点数の数値が続くと、タイムアウトが秒単位で設定されます。

source: Thread "NoTimers" is equivalent to Thread "NoTimers", true.
ja: Thread "NoTimers"はThread "NoTimers", trueと等価である。

source: Transform, HTML supports additional features in Unicode versions of AutoHotkey_L.
ja: トランスフォーム、HTMLはAutoHotkey_LのUnicodeバージョンで追加機能をサポートしています。

source: Transform, Unicode is available only in ANSI versions of AutoHotkey.
ja: Transform, UnicodeはAutoHotkeyのANSIバージョンでのみ利用可能です。

source: Transform itself was removed in v2.0.
ja: Transform自体はv2.0で削除されました。

source: TraySetIcon([FileName, IconNumber, Freeze]) replaces "Menu Tray, Icon".
ja: TraySetIcon([FileName, IconNumber, Freeze])は、「Menu Tray, Icon」を置き換えます。

source: True if the user clicked the right mouse button.
ja: ユーザーがマウスの右ボタンをクリックした場合、真になります。

source: Type(Value) returns one of the following strings:
ja: Type(Value)は、以下の文字列のいずれかを返す：

source: Type(Value) returns one of the following strings: String, Integer, Float, or the specific class of an object.
ja: Type(Value)は、以下の文字列のいずれかを返す：String、Integer、Float、またはオブジェクトの特定のクラス。

source: UTF-16: Unicode UTF-16 with little endian byte order, equivalent to CP1200.
ja: UTF-16：CP1200 に相当するリトルエンディアンバイトオーダーの Unicode UTF-16 です。

source: UTF-8: Unicode UTF-8, equivalent to CP65001.
ja: UTF-8：Unicode UTF-8、CP65001 と同等です。

source: Value is Float can be used to check whether a value is a pure floating-point number.
ja: Value is Floatは、値が純粋な浮動小数点数であるかどうかをチェックするために使用できる。

source: Value is Integer can be used to check whether a value is a pure integer.
ja: Value is Integerは、値が純粋な整数であるかどうかをチェックするために使用できます。

source: Value is Number can be used to check whether a value is a pure number.
ja: Value is Numberは、ある値が純粋な数であるかどうかを確認するために使用できます。

source: Value.HasMethod() works with all AutoHotkey values and objects by default, but allows HasMethod to be overridden for some objects or classes.
ja: Value.HasMethod()は、デフォルトではすべてのAutoHotkeyの値とオブジェクトで動作しますが、一部のオブジェクトやクラスではHasMethodをオーバーライドできます。

source: Value (String):
ja: Value（文字列）：

source: Value (String): The text entered by the user.
ja: Value（文字列）：ユーザーによって入力されたテキスト。

source: VarSetStrCapacity(&TargetVar [, RequestedCapacity]) replaces the v1 VarSetCapacity, but is intended for use only with UTF-16 strings (such as to optimize repeated concatenation); therefore RequestedCapacity and the return value are in characters, not bytes.
ja: VarSetStrCapacity(&TargetVar [, RequestedCapacity]) は、v1 VarSetCapacity を置き換えますが、（繰り返し連結の最適化など）UTF-16文字列にのみ使用することを意図しており、したがってRequestedCapacityと戻り値はバイトではなく文字です。

source: VarSetStrCapacity(&Var [, NewCapacity]) replaces the v1 VarSetCapacity, but is intended for use only with UTF-16 strings (such as to optimize repeated concatenation); therefore NewCapacity and the return value are in characters, not bytes.
ja: VarSetStrCapacity(&Var [, NewCapacity]) は、v1 VarSetCapacity を置き換えますが、（繰り返し連結の最適化など）UTF-16文字列にのみ使用することを意図しており、したがってNewCapacityと戻り値はバイトではなく文字です。

source: VerCompare(A, B) compares two version strings using the same algorithm as #Requires.
ja: VerCompare(A, B)は、#Requiresと同じアルゴリズムで2つのバージョン文字列を比較します。

source: WinGetClientPos([&OutX, &OutY, &OutWidth, &OutHeight, WinTitle, ...]) retrieves the position and size of the window's client area, in screen coordinates.
ja: WinGetClientPos([&OutX, &OutY, &OutWidth, &OutHeight, WinTitle, ...])ウィンドウのクライアント領域の位置とサイズを画面座標で取得します。

source: WinGetClientPos([&X, &Y, &W, &H, WinTitle, ...]) retrieves the position and size of the window's client area, in screen coordinates.
ja: WinGetClientPos([&X, &Y, &W, &H, WinTitle, ...])ウィンドウのクライアント領域の位置とサイズを画面座標で取得します。

source: X.Y := 1 is an error by default (the property is read-only).
ja: X.Y := 1はデフォルトでエラーとなります（プロパティは読み取り専用です）。

source: YesNo, Y/N or YN
ja: YesNo、Y/NまたはYN

source: YesNoCancel, Y/N/C or YNC
ja: YesNoCancel、Y/N/CまたはYNC

source: [A, B, C] creates an Array with the initial contents A, B and C (all variables in this case), where A is element 1.
ja: [A, B, C]は、初期内容A、B、C（この場合はすべて変数）を持つ配列を作成し、Aは要素1です。

source: ^+Left produces Ctrl+Shift+L followed literally by the letters eft
ja: ^+LeftはCtrl+Shift+Lの後にeftの文字が続きます

source: ^+{Left} produces Ctrl+Shift+Left
ja: ^+{Left}はCtrl+Shift+Leftです

source: ^j:: is the hotkey.
ja: ^j:: は、ホットキーです。

source: ^{+}{Left} produces Ctrl++ followed by Left
ja: ^{+}{Left}はCtrl++の後にLeftが続きます

source: ` (literal accent; i.e. two consecutive escape characters result in a single literal character)
ja: ` すなわち、2つのエスケープ文字が連続すると、1つのリテラル文字になる

source: ``, `,, `n, `r and `t.
ja: ``、`,、`n、`r、`t。

source: `n, `r and `r`n are all translated to a single Enter, unlike the default behavior and Raw mode, which translate `r`n to two Enter.
ja: `n、`r、`r`nは、デフォルトの動作やRawモードが`r`nを2つのEnterに変換するのとは異なり、すべて1つのEnterに変換されます。

source: and, or, is, in and contains act as line continuation operators even if followed by an assignment or other binary operator, since these are no longer valid variable names.
ja: and、or、is、in、containsは、代入や他の二項演算子が続いても、もはや有効な変数名ではないので、行継続演算子として機能します。

source: base is a pre-defined property which gets or sets the object's immediate base object (like ObjGetBase/ObjSetBase).
ja: baseは、オブジェクトの直接のベース・オブジェクト（ObjGetBase/ObjSetBaseなど）を取得または設定する事前定義プロパティです。

source: catch (MyError as err) permits parentheses, like most other control flow statements.
ja: catch (MyError as err)は、他の多くの制御フロー文と同様に、括弧を許可します。

source: catch Any catches anything.
ja: catch Anyは、何でもキャッチします。

source: catch ValueError as err catches a ValueError instance, which is assigned to err.
ja: catch ValueError as errは、ValueErrorインスタンスをキャッチし、errに代入します。

source: catch ValueError, TypeError as err catches either type and assigns the instance to err.
ja: catch ValueError, TypeError as errどちらかの型を捕らえ、インスタンスを err に代入します。

source: catch ValueError, TypeError catches either type.
ja: catch ValueError, TypeErrorは、他のタイプをキャッチします。

source: catch as err catches an Error instance, which is assigned to err.
ja: catch as errは、Errorインスタンスを捕捉し、errに代入されます。

source: catch catches an Error instance.
ja: catchは、Errorインスタンスを捕捉します。

source: cmd.exe (or the full path to it)
ja: cmd.exe(またはそのフルパス)

source: d or i
ja: d または i

source: else can now be used with loop, for, while and catch.
ja: elseは loop、for、while、catchと一緒に使えるようになりました。
